
## Plan Result (mng)

[CI link](https://github.com/fumi-mura/infra_portfolio/actions/runs/14656272443)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 7 to destroy.</code></pre>

* Create
  * module.iic_user.aws_identitystore_user.this[&#34;Admin&#34;]
  * module.iic_user.aws_identitystore_user.this[&#34;ReadOnly&#34;]
* Delete
  * module.iam_identity_center.aws_identitystore_user.this[&#34;Admin&#34;]
  * module.iam_identity_center.aws_identitystore_user.this[&#34;ReadOnly&#34;]
* Replace
  * module.iam_identity_center.aws_identitystore_group_membership.this[&#34;Admin&#34;]
  * module.iam_identity_center.aws_identitystore_group_membership.this[&#34;ReadOnly&#34;]
  * module.iam_identity_center.aws_ssoadmin_account_assignment.this[&#34;313744126666&#34;]
  * module.iam_identity_center.aws_ssoadmin_account_assignment.this[&#34;598981015011&#34;]
  * module.iam_identity_center.aws_ssoadmin_account_assignment.this[&#34;644370126241&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.iam_identity_center.aws_identitystore_group_membership.this["Admin"] must be replaced
-/+ resource "aws_identitystore_group_membership" "this" {
      ~ id                = "d-9567439836/17642af8-9041-70d5-e799-644f5e2cf104" -> (known after apply)
      ~ member_id         = "57344af8-5091-7024-7358-e523c32873a5" # forces replacement -> (known after apply) # forces replacement
      ~ membership_id     = "17642af8-9041-70d5-e799-644f5e2cf104" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iam_identity_center.aws_identitystore_group_membership.this["ReadOnly"] must be replaced
-/+ resource "aws_identitystore_group_membership" "this" {
      ~ id                = "d-9567439836/77744a58-9041-70c5-4fa0-a1fc31f467ad" -> (known after apply)
      ~ member_id         = "47845a08-20b1-709d-6c84-e72c65c83967" # forces replacement -> (known after apply) # forces replacement
      ~ membership_id     = "77744a58-9041-70c5-4fa0-a1fc31f467ad" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iam_identity_center.aws_identitystore_user.this["Admin"] will be destroyed
  # (because aws_identitystore_user.this is not in configuration)
  - resource "aws_identitystore_user" "this" {
      - display_name       = "Admin" -> null
      - external_ids       = [] -> null
      - id                 = "d-9567439836/57344af8-5091-7024-7358-e523c32873a5" -> null
      - identity_store_id  = "d-9567439836" -> null
      - user_id            = "57344af8-5091-7024-7358-e523c32873a5" -> null
      - user_name          = "Admin" -> null
        # (7 unchanged attributes hidden)

      - emails {
          - primary = true -> null
          - value   = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }

      - name {
          - family_name      = "user" -> null
          - given_name       = "Admin" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.iam_identity_center.aws_identitystore_user.this["ReadOnly"] will be destroyed
  # (because aws_identitystore_user.this is not in configuration)
  - resource "aws_identitystore_user" "this" {
      - display_name       = "ReadOnly" -> null
      - external_ids       = [] -> null
      - id                 = "d-9567439836/47845a08-20b1-709d-6c84-e72c65c83967" -> null
      - identity_store_id  = "d-9567439836" -> null
      - user_id            = "47845a08-20b1-709d-6c84-e72c65c83967" -> null
      - user_name          = "ReadOnly" -> null
        # (7 unchanged attributes hidden)

      - emails {
          - primary = true -> null
          - value   = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }

      - name {
          - family_name      = "user" -> null
          - given_name       = "ReadOnly" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.iam_identity_center.aws_ssoadmin_account_assignment.this["313744126666"] must be replaced
-/+ resource "aws_ssoadmin_account_assignment" "this" {
      ~ id                 = "57344af8-5091-7024-7358-e523c32873a5,USER,313744126666,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-7405710f9b04bb23,arn:aws:sso:::instance/ssoins-775858b230c132be" -> (known after apply)
      ~ principal_id       = "57344af8-5091-7024-7358-e523c32873a5" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.iam_identity_center.aws_ssoadmin_account_assignment.this["598981015011"] must be replaced
-/+ resource "aws_ssoadmin_account_assignment" "this" {
      ~ id                 = "57344af8-5091-7024-7358-e523c32873a5,USER,598981015011,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-7405710f9b04bb23,arn:aws:sso:::instance/ssoins-775858b230c132be" -> (known after apply)
      ~ principal_id       = "57344af8-5091-7024-7358-e523c32873a5" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.iam_identity_center.aws_ssoadmin_account_assignment.this["644370126241"] must be replaced
-/+ resource "aws_ssoadmin_account_assignment" "this" {
      ~ id                 = "57344af8-5091-7024-7358-e523c32873a5,USER,644370126241,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-775858b230c132be/ps-7405710f9b04bb23,arn:aws:sso:::instance/ssoins-775858b230c132be" -> (known after apply)
      ~ principal_id       = "57344af8-5091-7024-7358-e523c32873a5" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.iic_user.aws_identitystore_user.this["Admin"] will be created
  + resource "aws_identitystore_user" "this" {
      + display_name      = "Admin"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9567439836"
      + user_id           = (known after apply)
      + user_name         = "Admin"

      + emails {
          + primary = true
          + value   = (sensitive value)
        }

      + name {
          + family_name = "user"
          + given_name  = "Admin"
        }
    }

  # module.iic_user.aws_identitystore_user.this["ReadOnly"] will be created
  + resource "aws_identitystore_user" "this" {
      + display_name      = "ReadOnly"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9567439836"
      + user_id           = (known after apply)
      + user_name         = "ReadOnly"

      + emails {
          + primary = true
          + value   = (sensitive value)
        }

      + name {
          + family_name = "user"
          + given_name  = "ReadOnly"
        }
    }

Plan: 7 to add, 0 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":36,"Program":"tfcmt","SHA1":"fdc31343985fd731d4a4ff7bb446773b7a873948","Target":"mng","Vars":{},"WorkflowName":"Plan"} -->